# groupby

In [1]:
import pandas as pd

# Creating the DataFrame
data = {
    'Student': ['Student 1', 'Student 2', 'Student 3', 'Student 4', 'Student 5', 'Student 6', 'Student 7', 'Student 8', 'Student 9', 'Student 10'],
    'Gender': ['Male', 'Female', 'Male', 'Female', 'Male', 'Male', 'Female', 'Male', 'Female', 'Male'],
    'Age': [20, 21, 19, 22, 20, 21, 19, 22, 20, 21],
    'Test Score': [85, 92, 78, 95, 70, 88, 91, 79, 88, 75],
    'Study Hours': [6, 7, 5, 6, 4, 6, 7, 5, 6, 4]
}

df = pd.DataFrame(data)
df

      Student  Gender  Age  Test Score  Study Hours
0   Student 1    Male   20          85            6
1   Student 2  Female   21          92            7
2   Student 3    Male   19          78            5
3   Student 4  Female   22          95            6
4   Student 5    Male   20          70            4
5   Student 6    Male   21          88            6
6   Student 7  Female   19          91            7
7   Student 8    Male   22          79            5
8   Student 9  Female   20          88            6
9  Student 10    Male   21          75            4

In [3]:
df1 = df.groupby('Gender')

In [4]:
df1

In [5]:
for x , y in df1:
    print(f'==============={x}===============')
    print(y)

===============Female===============
     Student  Gender  Age  Test Score  Study Hours
1  Student 2  Female   21          92            7
3  Student 4  Female   22          95            6
6  Student 7  Female   19          91            7
8  Student 9  Female   20          88            6
===============Male===============
      Student Gender  Age  Test Score  Study Hours
0   Student 1   Male   20          85            6
2   Student 3   Male   19          78            5
4   Student 5   Male   20          70            4
5   Student 6   Male   21          88            6
7   Student 8   Male   22          79            5
9  Student 10   Male   21          75            4

In [7]:
df3 = df1.get_group('Female')

In [8]:
df3

     Student  Gender  Age  Test Score  Study Hours
1  Student 2  Female   21          92            7
3  Student 4  Female   22          95            6
6  Student 7  Female   19          91            7
8  Student 9  Female   20          88            6

In [10]:
df3['Test Score'].agg(['max','min'])

max    95
min    88
Name: Test Score, dtype: int64